Pandas

In [1]:
#  pands  -> Pandas is an open-source library that is used for handle data manipulation.

In [2]:
# # for installing pands in jupter or goolge colab
# #     !pip install pandas

# for installing in vs Code
#     pip install pandas

<!-- # data Structure of Pandas
(1). Series  --> It is one-dimentional array and it shows only values not coulmn

In [3]:
import pandas as pd

In [4]:
a=pd.Series([1,2,3,4,4,2])
a

0    1
1    2
2    3
3    4
4    4
5    2
dtype: int64

DataFrame

We have to create employee data using dictionary?

In [5]:
a1={'Emp_id':[1,2,3,4,5,6,7,8],
   'Emp_Name':['Sam','Raj','Mohit','Sam','Gourav','Mohit','Mohit','Mohit'],
   'Department':['IT','Sales','IT','Operations','HR','IT','Operations','HR'],
   'Working_hours':[8,9,9,9,9,8,7,8],
   'Salary':[23000,25000,35000,31000,28000,26000,30000,34000]
   }

In [6]:
df=pd.DataFrame(a1)
df

   Emp_id Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gourav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

How do you export dataframe into csv files?

In [7]:
df.to_csv('Day028_ExportCSVFile.csv',index=False)

In [8]:
df.to_csv('E:\\REGEX\\Python\\Day028_ExportCSVFile.csv',index=False)

In [9]:
csv_import=pd.read_csv('Day028_ExportCSVFile.csv')
csv_import

   Emp_id Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gourav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

In [10]:
# for top elements we use head(n)
csv_import.head(3)

   Emp_id Emp_Name Department  Working_hours  Salary
0       1      Sam         IT              8   23000
1       2      Raj      Sales              9   25000
2       3    Mohit         IT              9   35000

In [11]:
# for last elemtn we use tail(n)
csv_import.tail(2)

   Emp_id Emp_Name  Department  Working_hours  Salary
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

In [12]:
# Home Work
# name,id,stream,fees,semester,department (min 10 rows, and min 5 columns)
# make data from jupiter and import to colab

In [13]:
import pandas as pd

In [14]:
student={'id':[1,2,3,4,5,6,7,8,9,10],
        'name':['Ashu','Raj','Mohit','Sam','Gourav','Mohit','Mohit','Mohit','Raj','Mohit'],
   'stream':['IT','Sales','IT','Operations','HR','IT','Operations','HR','IT','Sales'],
   'fees':[23000,25000,35000,31000,28000,26000,30000,34000,23000,25000],
   'semester':[1,2,3,4,5,6,7,8,9,10],
   'department':['IT','Sales','IT','Operations','HR','IT','Operations','HR','IT','Sales']
   }
student_df=pd.DataFrame(student)
student_df.to_csv('Day028_A_ExportCSVFile.csv',index=False)

In [15]:
student_df

   id    name      stream   fees  semester  department
0   1    Ashu          IT  23000         1          IT
1   2     Raj       Sales  25000         2       Sales
2   3   Mohit          IT  35000         3          IT
3   4     Sam  Operations  31000         4  Operations
4   5  Gourav          HR  28000         5          HR
5   6   Mohit          IT  26000         6          IT
6   7   Mohit  Operations  30000         7  Operations
7   8   Mohit          HR  34000         8          HR
8   9     Raj          IT  23000         9          IT
9  10   Mohit       Sales  25000        10       Sales

# Day 2

In [16]:
import pandas as pd
covid_data=pd.read_csv('Day028_Sample_data_covid_toy.csv')
covid_data

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [18]:
# for geting top rows in dataframes we use -------head(n)-------
print(covid_data.head(3))
print('new data')
print(covid_data.head()) # by default it will give top 5 rows
print('new data')
print(covid_data.head(1))
print('new data')
print(covid_data.head(0)) # it will give empty dataframe
print('new data')
print(covid_data.head(10))

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No
new data
   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No
new data
   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
new data
Empty DataFrame
Columns: [age, gender, fever, cough, city, has_covid]
Index: []
new data
   age  gender  fever   cough       city has_covid
0   60    Male  103.0    Mild    Kolkata        No
1   27    Male  100.0    Mild      Delhi       Yes
2   42    Male  101.0    Mild      Delhi        No
3   31  Female   98.0    Mild    Kolkata        No
4   65  Female  101.0    Mild     Mumbai        No
5   84  Female    NaN    Mild  Bangalore       Yes
6   14    Male  101.0  Strong  Bangalore        No
7   20  Female    NaN  Strong     Mumbai       Yes
8   19  Female  100.0  Strong  Bangalore        No
9   64  Female  101.0    Mild      Delhi        No

In [19]:
df.columns

Index(['Emp_id', 'Emp_Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

In [22]:
# we use ---tail()--- when we want to see last rows in dataframes
print(covid_data.tail(3))
print('\nnew data\n')
print(covid_data.tail()) # by default it will give last 5 rows
print('\nnew data\n')
print(covid_data.tail(0)) # it will give empty dataframe

    age  gender  fever   cough       city has_covid
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

new data

    age  gender  fever   cough       city has_covid
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

new data

Empty DataFrame
Columns: [age, gender, fever, cough, city, has_covid]
Index: []

In [ ]:
# we use sample(n) for random rows in dataframes
print(covid_data.sample(3))

    age  gender  fever   cough       city has_covid
53   83    Male   98.0    Mild      Delhi       Yes
7    20  Female    NaN  Strong     Mumbai       Yes
76   80    Male  100.0    Mild  Bangalore       Yes

In [25]:
# we use shape for getting rows and columns in dataframes
print(covid_data.shape)

(100, 6)

In [ ]:
# for getting all elements from dataframe in list format we use ---values---
print(covid_data.values)

[[60 'Male' 103.0 'Mild' 'Kolkata' 'No']
 [27 'Male' 100.0 'Mild' 'Delhi' 'Yes']
 [42 'Male' 101.0 'Mild' 'Delhi' 'No']
 [31 'Female' 98.0 'Mild' 'Kolkata' 'No']
 [65 'Female' 101.0 'Mild' 'Mumbai' 'No']
 [84 'Female' nan 'Mild' 'Bangalore' 'Yes']
 [14 'Male' 101.0 'Strong' 'Bangalore' 'No']
 [20 'Female' nan 'Strong' 'Mumbai' 'Yes']
 [19 'Female' 100.0 'Strong' 'Bangalore' 'No']
 [64 'Female' 101.0 'Mild' 'Delhi' 'No']
 [75 'Female' nan 'Mild' 'Delhi' 'No']
 [65 'Female' 98.0 'Mild' 'Mumbai' 'Yes']
 [25 'Female' 99.0 'Strong' 'Kolkata' 'No']
 [64 'Male' 102.0 'Mild' 'Bangalore' 'Yes']
 [51 'Male' 104.0 'Mild' 'Bangalore' 'No']
 [70 'Male' 103.0 'Strong' 'Kolkata' 'Yes']
 [69 'Female' 103.0 'Mild' 'Kolkata' 'Yes']
 [40 'Female' 98.0 'Strong' 'Delhi' 'No']
 [64 'Female' 98.0 'Mild' 'Bangalore' 'Yes']
 [42 'Female' nan 'Strong' 'Bangalore' 'Yes']
 [12 'Male' 98.0 'Strong' 'Bangalore' 'No']
 [73 'Male' 98.0 'Mild' 'Bangalore' 'Yes']
 [71 'Female' 98.0 'Strong' 'Kolkata' 'Yes']
 [80 'Female' 98.0 'Mild' 'Delhi' 'Yes']
 [13 'Female' 100.0 'Strong' 'Kolkata' 'No']
 [23 'Male' nan 'Mild' 'Mumbai' 'No']
 [19 'Female' 100.0 'Mild' 'Kolkata' 'Yes']
 [33 'Female' 102.0 'Strong' 'Delhi' 'No']
 [16 'Male' 104.0 'Mild' 'Kolkata' 'No']
 [34 'Female' nan 'Strong' 'Mumbai' 'Yes']
 [15 'Male' 101.0 'Mild' 'Delhi' 'Yes']
 [83 'Male' 103.0 'Mild' 'Kolkata' 'No']
 [34 'Female' 101.0 'Strong' 'Delhi' 'Yes']
 [26 'Female' 98.0 'Mild' 'Kolkata' 'No']
 [74 'Male' 102.0 'Mild' 'Mumbai' 'Yes']
 [82 'Female' 102.0 'Strong' 'Bangalore' 'No']
 [38 'Female' 101.0 'Mild' 'Bangalore' 'No']
 [55 'Male' 100.0 'Mild' 'Kolkata' 'No']
 [49 'Female' 101.0 'Mild' 'Delhi' 'Yes']
 [50 'Female' 103.0 'Mild' 'Kolkata' 'No']
 [49 'Female' 102.0 'Mild' 'Delhi' 'No']
 [82 'Male' nan 'Mild' 'Kolkata' 'Yes']
 [27 'Male' 100.0 'Mild' 'Delhi' 'Yes']
 [22 'Female' 99.0 'Mild' 'Bangalore' 'Yes']
 [20 'Male' 102.0 'Strong' 'Delhi' 'No']
 [72 'Male' 99.0 'Mild' 'Bangalore' 'No']
 [19 'Female' 101.0 'Mild' 'Mumbai' 'No']
 [18 'Female' 104.0 'Mild' 'Bangalore' 'No']
 [66 'Male' 99.0 'Strong' 'Bangalore' 'No']
 [44 'Male' 104.0 'Mild' 'Mumbai' 'No']
 [19 'Male' 101.0 'Mild' 'Delhi' 'Yes']
 [11 'Female' 100.0 'Strong' 'Kolkata' 'Yes']
 [47 'Female' 100.0 'Strong' 'Bangalore' 'Yes']
 [83 'Male' 98.0 'Mild' 'Delhi' 'Yes']
 [60 'Female' 99.0 'Mild' 'Mumbai' 'Yes']
 [81 'Female' 101.0 'Mild' 'Mumbai' 'Yes']
 [71 'Male' nan 'Strong' 'Kolkata' 'No']
 [49 'Female' 99.0 'Strong' 'Bangalore' 'No']
 [23 'Male' 98.0 'Strong' 'Mumbai' 'Yes']
 [6 'Female' 104.0 'Mild' 'Kolkata' 'Yes']
 [24 'Female' 102.0 'Strong' 'Bangalore' 'Yes']
 [81 'Female' 98.0 'Strong' 'Mumbai' 'No']
 [56 'Female' 104.0 'Strong' 'Bangalore' 'Yes']
 [10 'Male' 100.0 'Mild' 'Bangalore' 'No']
 [42 'Male' 104.0 'Mild' 'Mumbai' 'No']
 [69 'Female' 102.0 'Mild' 'Bangalore' 'No']
 [51 'Male' 104.0 'Mild' 'Kolkata' 'No']
 [65 'Male' 99.0 'Mild' 'Bangalore' 'No']
 [54 'Female' 104.0 'Strong' 'Kolkata' 'No']
 [73 'Female' 103.0 'Mild' 'Delhi' 'No']
 [68 'Female' 101.0 'Strong' 'Delhi' 'No']
 [75 'Female' 104.0 'Strong' 'Delhi' 'No']
 [83 'Female' 101.0 'Mild' 'Kolkata' 'No']
 [34 'Male' 98.0 'Strong' 'Kolkata' 'Yes']
 [34 'Female' 104.0 'Strong' 'Delhi' 'No']
 [5 'Male' 102.0 'Mild' 'Kolkata' 'Yes']
 [80 'Male' 100.0 'Mild' 'Bangalore' 'Yes']
 [8 'Female' 101.0 'Mild' 'Kolkata' 'No']
 [11 'Male' 100.0 'Mild' 'Bangalore' 'Yes']
 [48 'Female' 103.0 'Mild' 'Kolkata' 'Yes']
 [14 'Female' 99.0 'Mild' 'Mumbai' 'Yes']
 [65 'Male' 99.0 'Mild' 'Delhi' 'No']
 [24 'Male' 98.0 'Mild' 'Kolkata' 'Yes']
 [17 'Female' 104.0 'Mild' 'Kolkata' 'No']
 [69 'Female' 98.0 'Strong' 'Mumbai' 'No']
 [16 'Female' 103.0 'Mild' 'Bangalore' 'Yes']
 [25 'Male' 104.0 'Mild' 'Bangalore' 'Yes']
 [47 'Male' 101.0 'Strong' 'Bangalore' 'No']
 [5 'Female' 100.0 'Mild' 'Kolkata' 'No']
 [46 'Male' 103.0 'Strong' 'Bangalore' 'No']
 [59 'Female' 99.0 'Strong' 'Delhi' 'No']
 [38 'Male' nan 'Mild' 'Delhi' 'Yes']
 [82 'Female' 102.0 'Strong' 'Kolkata' 'No']
 [27 'Male' 100.0 'Mild' 'Kolkata' 'Yes']
 [79 'Male' nan 'Strong' 'Kolkata' 'Yes']
 [12 'Female' 104.0 'Mild' 'Bangalore' 'No']
 [51 'Female' 101.0 'Strong' 'Kolkata' 'Yes']
 [20 'Female' 101.0 'Mild' 'Bangalore' 'No']
 [5 'Female' 98.0 'Strong' 'Mumbai' 'No']
 [10 'Female' 98.0 'Strong' 'Kolkata' 'Yes']]

In [ ]:
# describe() # it will give all the statistical data from dataframe like mean, median, mode, min, max, count, std, 25%, 50%, 75%
covid_data.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [28]:
# Modify Data in Dataframes
covid_data['has_covid'][2]='Yes'

C:\Users\aaa\AppData\Local\Temp\ipykernel_300\1188820866.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  covid_data['has_covid'][2]='Yes'
C:\Users\aaa\AppData\Local\Temp\ipykernel_300\1188820866.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  covid_data['has_covid'][2]='Yes'

In [35]:
covid_data.loc[2]

age             42
gender        Male
fever        101.0
cough         Mild
city         Delhi
has_covid      Yes
Name: 2, dtype: object

In [ ]:
# loc() # it will give the data from the given index
covid_data.loc[2:3,['age','gender','has_covid']]

KeyError: 1

In [38]:
# info() is used to get the information of the dataframes
covid_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [ ]:
# iloc() # it is used to get the data from the given index
# here we use index number instead of column name in loc() method

covid_data.iloc[2:3,0:3]

   age gender  fever
2   42   Male  101.0

In [41]:
covid_data['has_covid'].value_counts()

has_covid
No     54
Yes    46
Name: count, dtype: int64

In [42]:
covid_data['gender'].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [43]:
covid_data['cough'].value_counts()

cough
Mild      62
Strong    38
Name: count, dtype: int64

In [ ]:
# we will not do value_count on age because it is a continuous data and value_count is used for categorical data.T
# Catorical data is a data that can be divided into categories.
# Numerical data is a data that can be divided into numbers.